/*Напишите программу, которая выводит самое длинное слово переданной 
её символьной строки. Слово – это последовательность непробельных символов, 
ограниченная пробелами или концами строки.*/

#include <iostream>

using namespace std;


int main(){

	string s,best;

	while(cin >> s){
		if(best.size() < s.size()){
			best.size() == s.size();
		}
	}

	cout << best << " " << best.size() << endl;

	return 0;
}